tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Highly capable, feature-rich programming language
brew "perl"
# Library for command-line editing
brew "readline"
# Python version management
brew "pyenv"
# Command-line interface for SQLite
brew "sqlite"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# General-purpose data compression with high compression ratio
brew "xz"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Professional graphic design software
cask "affinity-designer"
# Menu bar icon organizer
cask "bartender"
# Dummy Display for Apple Silicon Macs to achieve custom resolutions
cask "betterdummy"
# Server and cloud storage browser
cask "cyberduck"
# Reimagine your terminal
cask "fig"
# Version of Cascadia Code without ligatures
cask "font-cascadia-mono"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Utility to render Jupyter notebooks
cask "jupyter-notebook-viewer"
# Software for Logitech devices
cask "logitech-options"
# Lyrics for iTunes, Spotify, Vox and Audirvana Plus
cask "lyricsx"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# App to write, plan, collaborate, and get organized
cask "notion"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Live wallpaper app
cask "paper"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# LaTeX editor
cask "texstudio"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
mas "Affinity Photo", id: 824183456
mas "Aurora Dictionary", id: 1154746981
mas "Days Matter", id: 494500492
mas "Easy CSV Editor", id: 1171346381
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "Honey", id: 1472777122
mas "iMovie", id: 408981434
mas "JSON Editor", id: 567740330
mas "Keynote", id: 409183694
mas "Multi Monitor Wallpaper", id: 504284434
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "PLIST Editor", id: 1157491961
mas "Userscripts", id: 1463298887
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
